# ==============================================================================================================
# public методы    — нет установленного управления доступом. Кто угодно может вызывать эти методы.
# protected методы — могут быть вызваны объектами определяющего класса или его подклассами.
# private методы   — не могут быть вызваны с явным получателем.
# ==============================================================================================================

class MyAlgorithm

    private
      def private
        "Private"
      end

    protected
      def protected
        "Protected"
      end

    public
      def public
        "Public"
      end
  end
  
# ==============================================================================================================
  
  class Another

    def private
      "Приватный, как объявлено ниже"
    end

    private :private
  end
# ==============================================================================================================
  